Revit 2026 API

# AlignmentStationLabel Properties

---

The AlignmentStationLabel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignmentId | The ElementId of the Alignment on which the SpotDimension is placed. |
|  | Element | The underlying SpotDimension element. |
|  | Station | The alignment station at which the SpotDimension is placed. |

#### Reference

AlignmentStationLabel Class

Autodesk.Revit.DB.Infrastructure Namespace